from itertools import chain

# "스타일"
# 14(13) single label
# '기타' 항목은 모델 개발시에만 쓰이고 실제로는 13개만 쓰임

############ 바본가 24(23)개가 맞다
STYLE_CATEGORIES = ['기타', '레트로', '로맨틱', '리조트', '매니시', '모던', '밀리터리', '섹시', '소피스트케이티드', '스트리트', '스포티', '아방가르드', '오리엔탈', '웨스턴', '젠더리스', '컨트리', '클래식', '키치', '톰보이', '펑크', '페미닌', '프레피', '히피', '힙합']

# 카테고리 single
CLOTHING_CATEGORIES = {
    "상의": ["탑", "블라우스", "티셔츠", "니트웨어", "셔츠", "브라탑", "후드티"],
    "하의": ["청바지", "팬츠", "스커트", "래깅스", "조거팬츠"],
    "아우터": ["코트", "재킷", "점퍼", "패딩", "베스트", "가디건", "짚업"],
    "원피스": ["드레스", "점프수트"]
}

CLOTHING_CATEGORIES_TOKEN = {
    "아우터": {"코트": 0, "재킷": 1, "점퍼": 2, "패딩": 3, "베스트": 4, "가디건": 5, "짚업": 6, },
    "하의": {"청바지": 0, "팬츠": 1, "스커트": 2, "래깅스": 3, "조거팬츠": 4, },
    "원피스": {"드레스": 0, "점프수트": 1, },
    "상의": {"탑": 0, "블라우스": 1, "티셔츠": 2, "니트웨어": 3, "셔츠": 4, "브라탑": 5, "후드티": 6, },
}

CLOTHING_CATEGORIES_TOKEN2 = {
    '아우터': 0,
    '코트': 1,
    '재킷': 2,
    '점퍼': 3,
    '패딩': 4,
    '베스트': 5,
    '가디건': 6,
    '짚업': 7,
    '하의': 8,
    '청바지': 9,
    '팬츠': 10,
    '스커트': 11,
    '래깅스': 12,
    '조거팬츠': 13,
    '원피스': 14,
    '드레스': 15,
    '점프수트': 16,
    '상의': 17,
    '탑': 18,
    '블라우스': 19,
    '티셔츠': 20,
    '니트웨어': 21,
    '셔츠': 22,
    '브라탑': 23,
    '후드티': 24
}



MIX_CLOTHING_CATEGORIES = {
    ('원피스'): 0,
    ('원피스', '하의'): 1,
    ('상의', '아우터'): 2,
    ('상의', '하의'): 3,
    ('아우터', '하의'): 4,
    ('상의', '원피스'): 5,
    ('아우터', '원피스'): 6,
    ('상의', '아우터', '원피스'): 7,
    ('아우터', '원피스', '하의'): 8,
    ('상의', '원피스', '하의'): 9,
    ('상의', '아우터', '하의'): 10,
    ('상의', '아우터', '원피스', '하의'): 11
}

# "색상(컬러)" - 21 single label (그러나 서브색상이 있을수도 없을수도 있음)
# 색상 존재, 서브색상 없을 수 있음
COLOR_CATEGORIES = {"블랙": 0, "화이트": 1, "그레이": 2, "레드": 3, "핑크": 4, "오렌지": 5, "베이지": 6, "브라운": 7, "옐로우": 8, "그린": 9, "카키": 10, "민트": 11, "블루": 12, "네이비": 13, "스카이블루": 14, "퍼플": 15, "라벤더": 16, "와인": 17, "네온": 18, "골드": 19, "실버": 20}

# "디테일" - MULTILABEL
DETAIL_CATEGORIES = {"프릴": 0, "퍼프": 1, "드롭숄더": 2, "러플": 3, "포켓": 4, "띠": 5, "셔링": 6, "단추": 7, "슬릿": 8, "비대칭": 9, "자수": 10, "X스트랩": 11, "리본": 12, "스트링": 13, "버클": 14, "니트꽈베기": 15, "플레어": 16, "체인": 17, "비즈": 18, "태슬": 19, "패치워크": 20, "컷아웃": 21, "롤업": 22, "스티치": 23, "레이스": 24, "플리츠": 25, "글리터": 26, "싱글브레스티드": 27, "지퍼": 28, "페플럼": 29, "폼폼": 30, "더블브레스티드": 31, "퀄팅": 32, "레이스업": 33, "퍼트리밍": 34, "디스트로이드": 35, "스터드": 36, "스팽글": 37, "프린지": 38, "드롭웨이스트": 39, }

# "프린트" - MULTILABEL
PRINT_CATEGORIES = {"도트": 0, "믹스": 1, "플로럴": 2, "무지": 3, "스트라이프": 4, "레터링": 5, "그래픽": 6, "깅엄": 7, "아가일": 8, "체크": 9, "호피": 10, "타이다이": 11, "페이즐리": 12, "하트": 13, "지그재그": 14, "그라데이션": 15, "지브라": 16, "하운즈 투스": 17, "카무플라쥬": 18, "뱀피": 19, "해골": 20, }

# "소재" - MULTILABEL
MATERIAL_CATEGORIES = {"패딩": 0, "퍼": 1, "무스탕": 2, "스웨이드": 3, "앙고라": 4, "코듀로이": 5, "시퀸/글리터": 6, "데님": 7, "저지": 8, "트위드": 9, "벨벳": 10, "비닐/PVC": 11, "울/캐시미어": 12, "합성섬유": 13, "헤어 니트": 14, "니트": 15, "레이스": 16, "린넨": 17, "메시": 18, "플리스": 19, "네오프렌": 20, "실크": 21, "스판덱스": 22, "자카드": 23, "가죽": 24, "면": 25, "시폰": 26, "우븐": 27, }

# "기장" - single label
################# 아우터 노멀 -> 노말
SLEEVE_CATEGORIES = {
    "아우터": {"크롭": 0, "노멀": 1, "노말": 1, "하프": 2, "롱": 3, "맥시": 4, },
    "하의": {"미니": 0, "니렝스": 1, "미디": 2, "발목": 3, "맥시": 4, },
    "원피스": {"미니": 0, "니렝스": 1, "미디": 2, "발목": 3, "맥시": 4, },
    "상의": {"크롭": 0, "노멀": 1, "노말": 1, "롱": 2, },
}
# SLEEVE_CATEGORIES = list(set(chain(*list(SLEEVE_CATEGORIES.values()))))

# "소매기장" - single label
# 상의6, 원피스6, 아우터5
# COORD에서는 "없음" 항목이 있으나 '데이터 구축 가이드라인'에는 없음
# 실제 확인했을 때에는 있었음 (Val에서는 아우터만 '없음'이 없음)
SHIRT_SLEEVES = {"없음": 0, "민소매": 1, "반팔": 2, "캡": 3, "7부소매": 4, "긴팔": 5, }

# "넥라인" - single label
# 상의 원피스 아우터
########### 홀토넥 -> 홀터넥 / 원 숄더 -> 원숄더
NECKLINE_CATEGORIES = {"라운드넥": 0, "유넥": 1, "브이넥": 2, "홀터넥": 3, "오프숄더": 4, "원숄더": 5, "스퀘어넥": 6, "노카라": 7, "후드": 8, "터틀넥": 9, "보트넥": 10, "스위트하트": 11, }

# "옷깃(카라)" - 상의 원피스 아우터
############# 테일러칼라 -> 테일러드칼라
COLLAR_CATEGORIES = {"셔츠칼라": 0, "보우칼라": 1, "세일러칼라": 2, "숄칼라": 3, "폴로칼라": 4, "피터팬칼라": 5, "너치드칼라": 6, "차이나칼라": 7, "테일러드칼라": 8, "밴드칼라": 9, }

# "핏" - single label
FIT_CATEGORIES = {"노멀": 0, "루즈": 1, "오버사이즈": 2, "스키니": 3, "와이드": 4, "타이트": 5, "벨보텀": 6, }
# 상의 핏 len: 4 multi False
# 	 ['루즈', '노멀', '오버사이즈', '타이트']
# 원피스 핏 len: 4 multi False
# 	 ['노멀', '루즈', '타이트', '오버사이즈']
# 하의 핏 len: 5 multi False
# 	 ['노멀', '와이드', '스키니', '벨보텀', '루즈']
# 아우터 핏 len: 4 multi False
# 	 ['오버사이즈', '루즈', '노멀', '타이트']


# '기타' 스타일 제외 23가지
STYLE_TOKENS = {
    '레트로': 0, '로맨틱': 1, '리조트': 2, '매니시': 3, '모던': 4, '밀리터리': 5, '섹시': 6, '소피스트케이티드': 7, '스트리트': 8, '스포티': 9,
    '아방가르드': 10, '오리엔탈': 11, '웨스턴': 12, '젠더리스': 13, '컨트리': 14, '클래식': 15, '키치': 16, '톰보이': 17, '펑크': 18, '페미닌': 19,
    '프레피': 20, '히피': 21, '힙합': 22, '기타': 23
}

ATT2TOKENS = {
    '옷종류': 'A', #카테고리
    '카테고리': 'B', #서브카테고리
    '색상': 'C',
    '서브색상': 'D',
    '소재': 'E',
    '핏': 'F',
    '기장': 'G',
    '소매기장': 'H',
    '프린트': 'I',
    '디테일': 'J',
    '넥라인': 'K',
    '옷깃': 'L',
}

TOKENS2ATT = {
    'A': 'category',
    'B': 'subCategory',
    'C': 'color',
    'D': 'subColor',
    'E': 'material',
    'F': 'fit',
    'G': 'sleeve',
    'H': 'shirtSleeve',
    'I': 'print',
    'J': 'detail',
    'K': 'neckLine',
    'L': 'collar'
}

